In [3]:
# Dependencies and Setup

# Pandas
import pandas as pd


# MatPlotLib/NumPy/SciPy
import scipy.stats as stats
import matplotlib.pyplot as plt
import numpy as np

#SQL Alchemy
import sqlalchemy
# had to install this with PIP
import psycopg2


from sqlalchemy import event
from sqlalchemy import create_engine

In [8]:
#Import SQL database into Pandas, create config to store username and password

from sqlalchemy import create_engine
from config import username, password
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/HPemployees')
connection = engine.connect()

In [17]:
#Query All records in the database
#data = engine.execute("SELECT * FROM salaries")
#for record in data:
#    print(record)

# Import files into dataframes
df_employees = pd.read_sql("SELECT * FROM employees",connection)
df_salaries = pd.read_sql("SELECT * FROM salaries",connection)
df_titles = pd.read_sql("SELECT * FROM titles",connection)

In [19]:
df_titles = df_titles.dropna()
df_titles

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [21]:
df_salaries = df_salaries.dropna()
df_salaries

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [22]:
df_employees = df_employees.dropna()
df_employees

        emp_no emp_title_id  birth_date first_name last_name sex   hire_date
0        10001        e0003  1953-09-02     Georgi   Facello   M  1986-06-26
1        10002        s0001  1964-06-02    Bezalel    Simmel   F  1985-11-21
2        10003        e0003  1959-12-03      Parto   Bamford   M  1986-08-28
3        10004        e0003  1954-05-01  Chirstian   Koblick   M  1986-12-01
4        10005        s0001  1955-01-21    Kyoichi  Maliniak   M  1989-09-12
...        ...          ...         ...        ...       ...  ..         ...
300019  499995        e0002  1958-09-24     Dekang  Lichtner   F  1993-01-12
300020  499996        e0003  1953-03-07       Zito      Baaz   M  1990-09-27
300021  499997        e0003  1961-08-03    Berhard    Lenart   M  1986-04-21
300022  499998        s0001  1956-09-05   Patricia   Breugel   M  1993-10-13
300023  499999        e0002  1958-05-01     Sachin   Tsukuda   M  1997-11-30

[300024 rows x 7 columns]

In [ ]:
#